tym2k1/zephyr_lpc55s69_puf/application/src/puf_prover.h
#ifndef PUF_PROVER_H
#define PUF_PROVER_H

#include "fsl_puf.h"
#include "flash_handler.h"
#include "mbedtls/ecp.h"
// #include "utils.h"
// #include "constants.h"
// #include "mbedtls/ecp.h"

#define NUM_RANDOM_NUMBERS 2
#define RANDOM_NUMBER_SIZE_BYTES 32
#define PUF_SLOT 0
#define CONSTANT_FOR_H_GENERATOR 123456789

/**
 * @brief Initialize the PUF prover.
 *
 * This function initializes the PUF Prover logic and then
 * either enrolls and saves the activation code to flash (if writeToFlash is true)
 * or reads the activation code from flash.
 *
 * @param puf                  Pointer to the PUF instance.
 * @param activation_code      Buffer where the activation code will be stored.
 * @param activation_code_size Size of the activation code in bytes.
 * @param flash_dev            Pointer to the flash device to be used.
 * @param flash_area           Pointer to the flash area structure to be used.
 * @param writeToFlash         True to enroll and write the activation code,
 *                             false to read it from flash.
 *
 * @return 0 on success, negative error code on failure.
 */
int PUF_Prover_Initialize(PUF_Type *puf,
                          uint8_t *activation_code,
                          size_t activation_code_size,
                          const struct flash_area *flash_area,
                          const struct device *flash_dev,
                          bool writeToFlash);



/**
 * @brief Initializes and optionally enrolls and starts the PUF module.
 *
 * @param puf               Pointer to PUF instance.
 * @param pufConfig         PUF configuration structure.
 * @param activation_code   Buffer to store or read the activation code.
 * @param activation_code_size Size of the activation code buffer.
 * @param flash_area        Pointer to flash area for storing activation code.
 * @param flash_dev         Flash device used for read/write operations.
 * @param writeToFlash      Set to true for enrollment; false to reuse stored code.
 * @return 0 on success, non zero on failure.
 */
int initializeAndStartPuf(PUF_Type *puf, puf_config_t pufConfig,
                          uint8_t *activation_code, size_t activation_code_size,
                          const struct flash_area *flash_area,
                          const struct device *flash_dev, bool writeToFlash);

/**
* @brief Retrieves the PUF key and optionally stores the key code in flash.
*
* @param puf               Pointer to PUF instance.
* @param activation_code   Pointer to activation code buffer.
* @param activation_code_size Size of activation code.
* @param flash_area        Flash area for key code storage.
* @param flash_dev         Flash device.
* @param writeToFlash      True if key code should be written to flash.
* @param outputBuffer      Output buffer for the intrinsic key (optional).
* @return 0 on success, non zero on failure.
*/
int getPufKey(PUF_Type *puf, uint8_t *activation_code, size_t activation_code_size,
              const struct flash_area *flash_area, const struct device *flash_dev,
              bool writeToFlash, uint8_t *outputBuffer);

/**
* @brief Deinitializes the PUF instance.
*
* @param puf           Pointer to PUF instance.
* @param pufConfig     PUF configuration structure.
*/
void pufDeinit(PUF_Type *puf, puf_config_t pufConfig);

/**
* @brief Computes the response from PUF for a given challenge.
*
* @param c             Input challenge.
* @param c_size        Size of the challenge.
* @param r             Output MPI result of the hashed response.
* @param puf           PUF instance.
* @param activation_code Activation code buffer.
* @param activation_code_size Activation code size.
* @param flash_area    Flash area used for key code.
* @param flash_dev     Flash device.
* @param writeToFlash  Whether to regenerate and store key code.
* @return 0 on success, non zero on failure.
*/
int getResponseToChallenge(const uint8_t *c, size_t c_size, mbedtls_mpi *r,
                            PUF_Type *puf, uint8_t *activation_code,
                            size_t activation_code_size,
                            const struct flash_area *flash_area,
                            const struct device *flash_dev, bool writeToFlash);

/**
* @brief Initializes ECC group and point h.
*
* @param grp           ECC group to initialize.
* @param h             ECC point h to compute.
* @param C             ECC point C to initialize.
* @return 0 on success, non zero on failure.
*/
int initECC(mbedtls_ecp_group *grp, mbedtls_ecp_point *h, mbedtls_ecp_point *C);

/**
* @brief Performs ECC enrollment operation with two challenges and stores resulting point C.
*
* @param grp           ECC group.
* @param h             Precomputed ECC point h.
* @param C             Output ECC commitment point C.
* @param c1, c2        Challenge 1 and 2 buffers.
* @param c1_size, c2_size Size of challenge buffers.
* @param puf           PUF instance.
* @param activation_code Activation code.
* @param activation_code_size Size of activation code.
* @param flash_area    Flash area used.
* @param flash_dev     Flash device.
* @param writeToFlash  Whether to store new key code.
* @return 0 on success, non zero on failure.
*/
int performEnrollment(mbedtls_ecp_group *grp, mbedtls_ecp_point *h, mbedtls_ecp_point *C,
                      const uint8_t *c1, size_t c1_size,
                      const uint8_t *c2, size_t c2_size,
                      PUF_Type *puf, uint8_t *activation_code,
                      size_t activation_code_size,
                      const struct flash_area *flash_area,
                      const struct device *flash_dev, bool writeToFlash);

/**
* @brief Adds and multiplies values modulo a given prime.
*
* @param mpiValue_1    Value to add.
* @param mpiValue_2    Value to multiply.
* @param mpiValue_R    Second value to multiply.
* @param mpiValue_p    Modulo value (usually EC group prime).
* @param result        Output result.
* @return 0 on success, non zero on error.
*/
int add_mul_mod(mbedtls_mpi *mpiValue_1, mbedtls_mpi *mpiValue_2,
                mbedtls_mpi *mpiValue_R, mbedtls_mpi *mpiValue_p,
                mbedtls_mpi *result);



/**
* @brief Performs PUF-based ECC authentication and response proof generation.
*
* @param grp           ECC group.
* @param g             Generator point g.
* @param h             Secondary generator point h.
* @param proof         Output ECC proof point.
* @param C             Commitment point.
* @param result_v      Output response scalar v.
* @param result_w      Output response scalar w.
* @param nonce         Output nonce used in hashing.
* @param c1, c2        Challenges used for authentication.
* @param c1_size, c2_size Sizes of challenges.
* @param puf           PUF instance.
* @param activation_code Activation code buffer.
* @param activation_code_size Size of activation code.
* @param flash_area    Flash area used for flash reads.
* @param flash_dev     Flash device used.
* @return 0 on success, non zero on failure.
*/
int performAuthentication(mbedtls_ecp_group *grp, mbedtls_ecp_point *g, mbedtls_ecp_point *h,
                          mbedtls_ecp_point *proof, mbedtls_ecp_point *C,
                          mbedtls_mpi *result_v, mbedtls_mpi *result_w,
                          mbedtls_mpi *nonce,
                          const uint8_t *c1, size_t c1_size,
                          const uint8_t *c2, size_t c2_size,
                          PUF_Type *puf, uint8_t *activation_code,
                          size_t activation_code_size,
                          const struct flash_area *flash_area,
                          const struct device *flash_dev);


#endif /* PUF_PROVER_H */
